Terraform plan for __dev__
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_kms_secret_ciphertext.bq_grafana_bucket_object will be created
  + resource "google_kms_secret_ciphertext" "bq_grafana_bucket_object" {
      + ciphertext = (known after apply)
      + crypto_key = "************************************************************************************************************"
      + id         = (known after apply)
      + plaintext  = (sensitive value)
    }

  # google_project_iam_member.bq_grafana_iam["roles/bigquery.dataViewer"] will be created
  + resource "google_project_iam_member" "bq_grafana_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-dev-321910"
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.bq_grafana_iam["roles/bigquery.jobUser"] will be created
  + resource "google_project_iam_member" "bq_grafana_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-dev-321910"
      + role    = "roles/bigquery.jobUser"
    }

  # google_service_account.bq_grafana will be created
  + resource "google_service_account" "bq_grafana" {
      + account_id   = "****************"
      + disabled     = false
      + display_name = "Service account for Big query and Grafana"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_key.bq_grafana_key will be created
  + resource "google_service_account_key" "bq_grafana_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "****************************"
      + public_key         = (known after apply)
      + public_key_type    = "******************"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # google_storage_bucket_object.bq_grafana_key_bucket_object will be created
  + resource "google_storage_bucket_object" "bq_grafana_key_bucket_object" {
      + bucket         = "ebo-dev"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "bigquery-grafana-dev.key"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Provider helm is undefined

  on istio_telemetry_gke.tf line 27, in module "istio_telemetry_proxy":
  27:     helm = helm.gke

Module module.istio_telemetry_proxy does not declare a provider named helm.
If you wish to specify a provider configuration for the module, add an entry
for helm in the required_providers block within the module.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #339](https://github.com/ebomart/commerce-infrastructure/actions/runs/1503133228)